#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_firebase_project.default: Refreshing state... [id=projects/hazel-sky-254210]
google_service_account.default: Refreshing state... [id=projects/hazel-sky-254210/serviceAccounts/api-store@hazel-sky-254210.iam.gserviceaccount.com]
google_firebaserules_ruleset.primary: Refreshing state... [id=projects/hazel-sky-254210/rulesets/12c0bbd4-45b4-4e4c-a18d-6d9f21dc5269]
google_artifact_registry_repository.api-store-repo: Refreshing state... [id=projects/hazel-sky-254210/locations/europe-central2/repositories/api-store-repo]
google_firestore_database.database: Refreshing state... [id=projects/hazel-sky-254210/databases/api-store]
google_container_cluster.primary: Refreshing state... [id=projects/hazel-sky-254210/locations/europe-central2-b/clusters/hazel-sky-254210-gke]
google_firestore_document.apidoc: Refreshing state... [id=projects/hazel-sky-254210/databases/api-store/documents/persons/4b7f376c-2376-4185-ba64-d539bdf40dcf-dw]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_artifact_registry_repository.api-store-repo must be replaced
-/+ resource "google_artifact_registry_repository" "api-store-repo" {
      - cleanup_policy_dry_run = false -> null
      ~ create_time            = "2024-06-30T06:00:44.223943Z" -> (known after apply)
      ~ effective_labels       = {} -> (known after apply)
      ~ id                     = "projects/hazel-sky-254210/locations/europe-central2/repositories/api-store-repo" -> (known after apply)
      - labels                 = {} -> null
      ~ name                   = "api-store-repo" -> (known after apply)
      ~ repository_id          = "api-store-repo" -> "api-store-repository" # forces replacement
      ~ terraform_labels       = {} -> (known after apply)
      ~ update_time            = "2024-06-30T06:00:44.223943Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @baldcodr, Action: `pull_request`*